# Pandas ==> open source library ==> data manipulation

In [ ]:
#data structure:
#(1). Series==> 1-D ==> only values
#(2). DataFrame ==> multi-dimensional => values with column name

In [1]:
a={"id":[1,2,3,4,5],
   "Name":['Sam','Garvit','Rahul','Mayank','Kirti'],
   "Department":['IT','IT','HR','OPERATIONS','IT'],
   "Working_hours":[8,9,8,8,9],
   "Salary":[34000,23000,400,45000,50000]
    
}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(a)
df

   id    Name  Department  Working_hours  Salary
0   1     Sam          IT              8   34000
1   2  Garvit          IT              9   23000
2   3   Rahul          HR              8     400
3   4  Mayank  OPERATIONS              8   45000
4   5   Kirti          IT              9   50000

In [4]:
df.head()#top five data

   id    Name  Department  Working_hours  Salary
0   1     Sam          IT              8   34000
1   2  Garvit          IT              9   23000
2   3   Rahul          HR              8     400
3   4  Mayank  OPERATIONS              8   45000
4   5   Kirti          IT              9   50000

In [5]:
df.tail()#bottom five data

   id    Name  Department  Working_hours  Salary
0   1     Sam          IT              8   34000
1   2  Garvit          IT              9   23000
2   3   Rahul          HR              8     400
3   4  Mayank  OPERATIONS              8   45000
4   5   Kirti          IT              9   50000

In [6]:
df.sample(4)#ramdom data

   id    Name  Department  Working_hours  Salary
3   4  Mayank  OPERATIONS              8   45000
4   5   Kirti          IT              9   50000
0   1     Sam          IT              8   34000
1   2  Garvit          IT              9   23000

In [7]:
df.loc[:2,["id","Salary"]]#data extraction==> starting and last values are include

   id  Salary
0   1   34000
1   2   23000
2   3     400

In [8]:
df.iloc[:2,[0,1,4]]#starting include and last value exclude

   id    Name  Salary
0   1     Sam   34000
1   2  Garvit   23000

In [10]:
df.info()#complete overview

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             5 non-null      int64
 1   Name           5 non-null      object
 2   Department     5 non-null      object
 3   Working_hours  5 non-null      int64
 4   Salary         5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 332.0+ bytes

In [11]:
df.describe()#statiscal overview

             id  Working_hours        Salary
count  5.000000       5.000000      5.000000
mean   3.000000       8.400000  30480.000000
std    1.581139       0.547723  19780.091001
min    1.000000       8.000000    400.000000
25%    2.000000       8.000000  23000.000000
50%    3.000000       8.000000  34000.000000
75%    4.000000       9.000000  45000.000000
max    5.000000       9.000000  50000.000000

In [12]:
df.columns

Index(['id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')

In [13]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')]

In [14]:
df.to_csv("C:\\Users\\user\\pandas\\new_record.csv")

In [15]:
df.read_csv("C:\\Users\\user\\pandas\\new_record.csv")

AttributeError: 'DataFrame' object has no attribute 'read_csv'

In [16]:
df

   id    Name  Department  Working_hours  Salary
0   1     Sam          IT              8   34000
1   2  Garvit          IT              9   23000
2   3   Rahul          HR              8     400
3   4  Mayank  OPERATIONS              8   45000
4   5   Kirti          IT              9   50000

In [17]:
df["Department"].value_counts() #total of sub-categories in acategory

Department
IT            3
HR            1
OPERATIONS    1
Name: count, dtype: int64

In [19]:
df["Working_hours"].value_counts()

Working_hours
8    3
9    2
Name: count, dtype: int64

In [20]:
df.sort_values(by="Salary")

   id    Name  Department  Working_hours  Salary
2   3   Rahul          HR              8     400
1   2  Garvit          IT              9   23000
0   1     Sam          IT              8   34000
3   4  Mayank  OPERATIONS              8   45000
4   5   Kirti          IT              9   50000

In [21]:
df.sort_index()

   id    Name  Department  Working_hours  Salary
0   1     Sam          IT              8   34000
1   2  Garvit          IT              9   23000
2   3   Rahul          HR              8     400
3   4  Mayank  OPERATIONS              8   45000
4   5   Kirti          IT              9   50000

In [22]:
df['Salary'].astype(float) #we can change data type of elements

0    34000.0
1    23000.0
2      400.0
3    45000.0
4    50000.0
Name: Salary, dtype: float64

In [23]:
df['Salary'].add(1000)

0    35000
1    24000
2     1400
3    46000
4    51000
Name: Salary, dtype: int64

In [24]:
df.count()

id               5
Name             5
Department       5
Working_hours    5
Salary           5
dtype: int64

In [28]:
df.min()

id                    1
Name             Garvit
Department           HR
Working_hours         8
Salary              400
dtype: object

In [26]:
df.max()

id                        5
Name                    Sam
Department       OPERATIONS
Working_hours             9
Salary                50000
dtype: object

In [30]:
df.sum()

id                                      15
Name             SamGarvitRahulMayankKirti
Department              ITITHROPERATIONSIT
Working_hours                           42
Salary                              152400
dtype: object

In [31]:
df.filter(items=['Name','Department'])

     Name  Department
0     Sam          IT
1  Garvit          IT
2   Rahul          HR
3  Mayank  OPERATIONS
4   Kirti          IT

In [32]:
df[['Name','Department']]

     Name  Department
0     Sam          IT
1  Garvit          IT
2   Rahul          HR
3  Mayank  OPERATIONS
4   Kirti          IT

In [33]:
df.filter(items=[2,3],axis=0)

   id    Name  Department  Working_hours  Salary
2   3   Rahul          HR              8     400
3   4  Mayank  OPERATIONS              8   45000

In [34]:
df.to_dict()

{'id': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5},
 'Name': {0: 'Sam', 1: 'Garvit', 2: 'Rahul', 3: 'Mayank', 4: 'Kirti'},
 'Department': {0: 'IT', 1: 'IT', 2: 'HR', 3: 'OPERATIONS', 4: 'IT'},
 'Working_hours': {0: 8, 1: 9, 2: 8, 3: 8, 4: 9},
 'Salary': {0: 34000, 1: 23000, 2: 400, 3: 45000, 4: 50000}}

In [35]:
df.to_string()

'   id    Name  Department  Working_hours  Salary\n0   1     Sam          IT              8   34000\n1   2  Garvit          IT              9   23000\n2   3   Rahul          HR              8     400\n3   4  Mayank  OPERATIONS              8   45000\n4   5   Kirti          IT              9   50000'

In [36]:
df.columns[0:3] # starting column label

Index(['id', 'Name', 'Department'], dtype='object')

In [40]:
df.columns.tolist() #list of column labels

['id', 'Name', 'Department', 'Working_hours', 'Salary']

In [41]:
df.columns.values #array of column labels

array(['id', 'Name', 'Department', 'Working_hours', 'Salary'],
      dtype=object)

In [42]:
df.rename(columns={'Name':'updated_name','Salary':'updated_salary'}) # to rename columns

   id updated_name  Department  Working_hours  updated_salary
0   1          Sam          IT              8           34000
1   2       Garvit          IT              9           23000
2   3        Rahul          HR              8             400
3   4       Mayank  OPERATIONS              8           45000
4   5        Kirti          IT              9           50000

In [44]:
df['New_salary_record']=df['Salary'].where(df['Salary']>=40000 ,other=0)

In [45]:
df

   id    Name  Department  Working_hours  Salary  New_salary_record
0   1     Sam          IT              8   34000                  0
1   2  Garvit          IT              9   23000                  0
2   3   Rahul          HR              8     400                  0
3   4  Mayank  OPERATIONS              8   45000              45000
4   5   Kirti          IT              9   50000              50000